Repository: Tezorc/galettedoc
Catalog: source/locale/*/LC_MESSAGES/development/codage.po
Languages: fr

source: Galette source code
fr: Code source de Galette

source: Galette is a free software licensed under GPL version 3 and written in PHP. Galette is only compatible with PHP 7.1 or more recent.
fr: Galette est un logiciel libre sous licence GPL version 3, écrit en PHP. Galette est compatible avec PHP 7.1 et plus récent.

source: While developing, you may find useful to do a :doc:`bit of debug <debug>`...
fr: Lors du développement, vous pourriez trouver utile :doc:`un peu de déboguage <debug>`...

source: It is also possible to change some :ref:`Galette behaviors (verbosity level, application mode, ...) <behavior>`.
fr: Il est également possible de modifier certains :ref:`comportements de Galette (niveau de verbosité, mode de l'application, ...) <behavior>`.

source: Filesystem hierarchy
fr: Système de fichiers

source: Here is a plan of Galette used directories and some explanations about them:
fr: Voici un plan des dossiers utilisés par Galette et queqlues explications sur ces derniers :

source: |folder| `config`: configuration files
fr: |folder| `config`: fichiers de configuration

source: |folder| `data`: directory to store data
fr: |folder| `data` : répertoire de stockage des données

source: |folder| `attachments`: files attached to emailings
fr: |folder| `attachments` : fichiers attachés aux emailings

source: |folder| `cache`: caching directory
fr: |folder| `cache` : dossier du cache

source: |folder| `exports`: where CSV exports are stored
fr: |folder| `exports` : où les exports CSV sont stockés

source: |folder| `files`: files attached to members with dynamic fields of type file
fr: |folder| `files` : fichiers attachés aux adhérents via des champs dynamiques de type fichier

source: |folder| `imports`: where to place CSV files you want to import
fr: |folder| `imports` : emplacement pour les fichiers CSV que vous osuhatez importer

source: |folder| `logs`: :ref:`log files <galettelog>`
fr: |folder| `logs` : :ref:`fichiers de log <galettelog>`

source: |folder| `photos`: members photos, and logos
fr: |folder| `photos` : photos des adhérents et logos

source: |folder| `tempimages`: temporary captcha images
fr: |folder| `tempimages` : images temporaires de captcha

source: |folder| `templates_c`: used to store Smarty compiled templates
fr: |folder| `templates_c` : utilisé pour stocker les gabarits compilés de Smarty

source: |folder| `includes`: libraries, functions and Galette instantiation
fr: |folder| `includes` : bibliothèques, fonctions et instanciation de Galette

source: |folder| `fields_def`: definition of the fields for some objects. A huge fields definition in class cause performances issues...
fr: |folder| `fields_def` : définition des champs de certains objets. Une définition des champs trop importante peut causer des problèmes de performances...

source: |folder| `routes`: routes configuration for Slim
fr: |folder| `routes` : configuration des routes de Slim

source: |folder| `smarty_plugins`: specific Smarty plugin for Translation
fr: |folder| `smarty_plugins` : plugin Smarty spécifique pour la traduction

source: |phpfile| `dependencies.php`: dependencies configuration for Slim. This handle all routes ACLs
fr: |phpfile| `dependencies.php` : dépendences pour Slim. Intègre tous les droits des routes

source: |phpfile| `galette.inc.php`: one of main Galette instantiation files
fr: |phpfile| `galette.inc.php` : un des fichiers principaux d'instanciation de Galette

source: |folder| `install`: installation script
fr: |folder| `install` : scripts d'installation

source: |folder| `lang`: translation files and scripts
fr: |folder| `lang` : fichiers et scripts de traduction

source: |folder| `lib`: internal framework
fr: |folder| `lib` : framework interne

source: |folder| `Galette`: Galette framework
fr: |folder| `Galette` : framework Galette

source: |folder| `Common`: `Galette\\Commons` classes
fr: |folder| `Common` : classes `Galette\\Commons`

source: |folder| `Core`: `Galette\\Core` classes
fr: |folder| `Core` : classes `Galette\\Core`

source: |folder| `Controllers`: :ref:`Controllers <controllers>` classes (since 0.9.4)
fr: |folder| `Controllers`: :ref:`Controllers <controllers>` classes (depuis 0.9.4)

source: |folder| `plugins`: :doc:`directory to install plugins <../plugins/index>`
fr: |folder| `plugins` : :doc:`dossier d'installation des plugins <../plugins/index>`

source: |folder| `templates`: Smarty templates source code
fr: |folder| `templates` : code source des gabarits Smarty

source: |folder| `default`: default Galette theme
fr: |folder| `default` : thème par défaut de Galette

source: Writting Conventions
fr: Conventions d'écriture

source: Galette source code must follow `PSR2 writting conventions <https://www.php-fig.org/psr/psr-2/>`_. To respect a writting convention make the source code more easy to read, the syntax is the same from a file to another.
fr: L code source de Galette doit respecter `les conventions d'écriture PSR2 <https://www.php-fig.org/psr/psr-2/>`_. Respecter une convention de codage rend le code source plus aisé à lire, la syntaxe étant identique d'un fichier à l'autre.

source: You can use `PHP Code Sniffer <https://pear.php.net/package/PHP_CodeSniffer>`_ to your changed code in order to be sure coding rules are respected. Some warnings may be ignored, but errors must be all fixed. An example of ``phpcs``:
fr: Vous pouvez utiliser `PHP Code Sniffer <https://pear.php.net/package/PHP_CodeSniffer>`_ sur le code modifié pour vous assurer que les conventions sont respectées. Certains avertissements peuvent être ignorés, mais les erreurs doivent toutes être corrigées. Un exemple de ``phpcs`` :

source: Galette is licensed under GPL version 3. Each PHP source file must contain the following mention (this example is from Galette `Authentication` class):
fr: Galette est sous licence GPL version 3. Chaque fichier PHP doit contenir les mentions suivantes (cet exemple provint de la classe `Authentication` de Galette) :

source: If your php file is not a class, use the same model, but just remove the class declaration and docblock.
fr: Si le fichier PHP n'est pas une classe, utilisez le même modèle, mais supprimez la partie concernant la classe.

source: To help other developers to understand the code, we will try to document the code as well as possible.
fr: Pour aider les autres développeurs à comprendre le code, nous essayons de le documenter autant que possible.

source: Create a release
fr: Créer une release

source: Releases are created against tags in the GIT repository. As an example to get an archive for Galette 0.9:
fr: Les releases sont crées à partir de tags du dépôt GIT. Par exemple, pour obtenir une archive de Galette 0.9 :

source: Note this archive will not embed :ref:`external libraries <deps>` (Smarty, Zend, tcpdf, ...); you will have to add them to the ``galette-0.9.tar.bz2`` file.
fr: Notez que cette archive ne contiendra pas les :ref:`bibliothèques externes <deps>` (Smarty, Zend, tcpdf, ...); vous devrez les ajouter au fichier ``galette-0.9.tar.bz2``.

source: Here is the script used for Galette nightly build:
fr: Voici le script utilisé pour l'archive quotidienne de Galette :

source: Finaly, archive may be signed (to check download integrity):
fr: Finalement, l'archive peut être signée (pour vérifier l'intégrité du téléchargement) :
