Repository: Tezorc/galettedoc
Catalog: source/locale/*/LC_MESSAGES/development/controllers.po
Languages: fr

source: Controllers
fr: Contrôleurs

source: Controllers are - in a MVC model - in charge of make relation between an URL and Objects that does the job behind the scenes. Since Galette uses Slim Framework, we've used anonymous functions in routes; but that makes all that code not reusable; therefore there were plenty of code that was very similar in several places.
fr: Les contrôleurs - dans un modèle MVC - sont en charge de créer la relation entre une URL et les Objets qui font le travail en arrière-plan. Depuis que Galette utilise le framework Slim, nous avons utilisé des fonctions anonymes dans les routes ; mais cela rend le code impossible à réutiliser ; il y avait donc pas mal de code très similaire à différents endroits.

source: This includes two steps removal mechanisms, outputs, and so on.
fr: Cela inclut le mécanisme de suppression en deux étapes, les sorties, etc.

source: With new controllers, is is now possible to add specific methods that ease the development, and makes it less dependent on the framework. Check the `Slim documentation about container resolution <https://www.slimframework.com/docs/v3/objects/router.html#container-resolution>`_ to known more.
fr: Avec les nouveaux contrôleurs, il est possible d'ajouter des méthodes spécifiques pour faciliter le développement, et le rendre moins dépendent du framework. Voyez la `documentation Slim sur la résolution de contrôleurs <https://www.slimframework.com/docs/v3/objects/router.html#container-resolution>`_ pour en savoir plus.

source: Of course, plugins can inherit of existing controllers and benefit of existing automations!
fr: Bien entendu, les plugins peuvent hériter des contrôleurs existants et bénéficier des automatisations !

source: Abstract controller
fr: Contrôleur abstrait

source: Galette provides an ``AbstractController`` class all controllers must inherit. It declares in its constructor all properties from dependency injection used:
fr: Galette fourni une classe ``AbstractController`` dont doivent hériter tous les contrôleurs. Elle déclare dans son constructeur toutes les propriétés utilisées depuis le système d'injection de dépendances :

source: ``$zdb`` database instance,
fr: ``$zdb`` instance de base de données,

source: ``$login`` current logged in user instance,
fr: ``$login`` instance de l'utilisateur actuellement connecté,

source: ``$preferences`` Galette configuration instance,
fr: ``$preferences`` instance de la configuration de Galette,

source: ``$view`` Smarty instance,
fr: ``$view`` instance de Smarty,

source: All those properties are then accessible like ``$this->zdb`` inside controllers.
fr: Toutes ces propriétés sont alors accessibles depuis les contrôleurs de manière similaire à ``$this->zdb``.

source: CRUD controllers
fr: Contrôleurs CRUD

source: CRUD stands for Create, Read, Update, Delete. Galette provides a ``Galette\Controllers\CrudController`` abstract class all objects that suits CRUD should rely on. By extending this class, you must declare all abstract methods:
fr: CRUD signifie Create, Read, Update, Delete (Créer, Lire, Mettre à jour, Supprimer). Galette fourni une classe abstraite ``Galette\Controllers\CrudController`` de laquelle tous les contrôleurs des objets qui utilisent CRUD devraient hériter. En étendant cette classe, vous devrez déclarer toutes les méthodes abstraites :

source: ``add`` for the add page,
fr: ``add`` pour la page d'ajout,

source: ``doAdd`` that will handle the add code,
fr: ``doAdd`` qui gèrera le code de l'ajout lui-même,

source: ``list`` for a list,
fr: ``list`` pour la liste,

source: ``filter`` for list filtering,
fr: ``filter`` pour le filtrage de la liste,

source: ``edit`` for the edit page,
fr: ``edit`` pour la page de modification,

source: ``doEdit`` that will handle the edit code,
fr: ``doEdit`` qui gèrera le code de modification lui-même,

source: For most of the pages, ``add`` and ``edit`` as well as ``doAdd`` and ``doEdit`` may be very similar; then you can use another new method (say ``store``) that does the real job (that was not possible with anonymous functions previousely used):
fr: Pour la plupart des pages, ``add`` et ``edit`` ainsi que ``doAdd`` et ``doEdit`` seront très similaires ; vous pouvez alors utiliser une autre méthode (disons ``store``) qui fera le vrai travail (ce n'était pas possible avec les fonctions anonymes utilisées précédemment) :

source: Two steps removal (one for removal confirmation, and then real removal) is quite simple: most of the code is automatically handled from the ``CrudController``; you will have to define a few methods, to set the confirmation page title, the form and redirection URLs, and the removal itself; without taking care of what will be output. As an example, for payment types removal, this looks like the following:
fr: La suppression en deux étapes (un pour la foncirmation de suppression, l'autre pour réellement supprimer) est assez simple : la majorité du code est automatiquement traité depuis le ``CrudController`` ; vous devez définir quelques méthodes, pour le titre de la page de confirmation, les URL du formulaire et des redirections, ainsi que la suppression elle même ; sans avoir à prendre en compte ce qui sera affiché. Par exemple, pour la suppression des types de paiement, cela ressemble à :

source: As you can see, we remove only one payment type at once; but you can also handle batch removal, with a few adaptations from the example below, and redefinition of the ``getIdsToRemove`` method that rely per default on a ``id`` argument set in URL.
fr: Comme vous pouvez le voir, on supprime un type de paiement à la fois ; mais on peut aussi gérer la suppression par lots, avec quelques adaptations du code ci-dessus et la redéfinition de la méthode ``getIdsToRemove`` qui se base par défaut sur un argument``id`` fourni dans l'URL.

source: PDF and CSV controllers
fr: Contrôleurs PDF et CSV

source: The ``PdfController`` and ``CsvController`` in Galette centralize all PDF/CSV outputs, but the most interesting point is the ``sendResponse`` method that set correct headers and contents for those specific outputs.
fr: Les classe ``PdfController`` et ``CsvController`` dans Galette centralisent toutes les sorties PDF/CSV, mais la partie la plus intéressante est la méthode ``sendResponse`` qui place correctement les en-têtes et contenus pour ces sorties spécifiques.

source: The ``PdfController::sendResponse`` method waits for a ``Slim\Http\Response`` and a ``Galette\IO\Pdf`` objects to work.
fr: La méthode ``PdfController::sendResponse`` attend un objet ``Slim\Http\Response`` et un ``Galette\IO\Pdf`` pour fonctionner.

source: The ``CsvController::sendResponse`` method waits for a ``Slim\Http\Response``, path to the file on disk, and file name for download.
fr: La méthode ``CsvController::sendResponse`` attend un objet ``Slim\Http\Response``, le chemin sur le disques, et le nom du fichier pour le téléchargement.

source: Usage in routes
fr: Utilisation dans les routes

source: Instead of using anonymous function directly in routes, you will call controller's methods. For example , for members it would look like:
fr: Au lieu d'utiliser des fonctions anonymes directement dans les routes, vous appellerez les méthodes des contrôleurs. Par exemple, pour les adhérents ça ressemblerait à :
