Repository: Tezorc/galettedoc
Catalog: source/locale/*/LC_MESSAGES/development/contributor.po
Languages: fr

source: How to contribute
fr: Comment contribuer

source: There are numerous ways to contribute to an Open Source project like Galette. You may:
fr: Il existe différentes façons de contribuer à un projet Open Source comme Galette. Vous pouvez :

source: help on questions asked by others on `user mailing list <https://listengine.tuxfamily.org/lists.galette.eu/users/>`_,
fr: aider sur les questions posées par d'autres sur `la liste de diffusion des utilisateurs <https://listengine.tuxfamily.org/lists.galette.eu/users/>`_,

source: help on testing proposed fixes and features,
fr: aider à tester les correctifs et fonctionnalités proposés,

source: help on `translations (Galette, plugins, documentation) <https://hosted.weblate.org/projects/galette/galette/>`_,
fr: aider à traduire (Galette, plugins, documentation) <https://hosted.weblate.org/projects/galette/galette/>`_,

source: help on documentation,
fr: aider sur sur la documentation,

source: `offer the developer a donation <https://www.paypal.me/galettesoft>`_ (contact him if you prefer to use a check or a transfer),
fr: `faire un don au développeur <https://www.paypal.me/galettesoft>`_ (contactez-le si vous préférez utiliser un chèque ou un virement),

source: and, last but not least, help on :ref:`writting code <contrib_coding>`.
fr: en enfin, mais pas des moindres, aider au :ref:`développement <contrib_coding>`.

source: This documentation is a technical overview of the contribution process to the source code of Galette and its plugins. Read the `how to contribute to Galette <https://galette.eu/dc/index.php/pages/Contribuer?navlang=en>`_ page on our website if your are looking for an introduction of the global process.
fr: La présente documentation est un aperçu technique du processus de contribution au code source de Galette et de ses plugins. Lisez la page `comment contribuer à Galette <https://galette.eu/dc/index.php/pages/Contribuer?navlang=fr>`_ sur le site si vous cherchez une introduction plus générale du processus.

source: Writting code
fr: Écrire du code

source: To fix a bug on the stable version, you have to work on the `master` branch. Use the development version on the `develop` branch to implement new features or fix issues in the next release.
fr: Pour corriger un bogue sur la version stable, vous devrez travailler sur la branche `master`. Utilisez la version de développement sur la branche `develop` pour ajouter de nouvelles fonctionnalités ou corriger des bogues dans la prochaine release.

source: Working on separate branches is a well-known GIT good practice I advise you to follow :)
fr: Travailler sur des branches distinctes est une bonne pratique GIT bien connue que je vous conseille d'utiliser :)

source: If you just want to have look at the development version, `download Galette nightly build archive <https://downloads.tuxfamily.org/galette/galette-dev.tar.bz2>`_ which is updated each night.
fr: Si vous souhaitez juste voir la version de développement, `téléchargez l'archive nightly de Galette <https://downloads.tuxfamily.org/galette/galette-dev.tar.bz2>`_ qui est générée toutes les nuits.

source: To send us a code modification, :ref:`read our sending patch practical example <sendpatch>`.
fr: Pour nous envoyer une modification du code, :ref:`conslutez notre exemple pratique de soumission de patch <sendpatch>`.

source: Development model
fr: Modèle de développement

source: `Vincent Driessen <https://nvie.com>`_ published in 2010 a `development model for GIT branches I found very pertinent <https://nvie.com/posts/a-successful-git-branching-model/>`_, and that I decided to use for Galette. With the ``git-flow`` tool from the same author, the workflow is quite simple to follow. Having doubts? Let's take a look at `this article which explains why you should use git-flow <https://jeffkreeftmeijer.com/2010/why-arent-you-using-git-flow/>`_.
fr: `Vincent Driessen <https://nvie.com>`_ a publié en 2010 un `modèle de développemennt pour les branches GIT que j'ai trouvé très pertinent <https://nvie.com/posts/a-successful-git-branching-model/>`_, et que j'ai décidé d'utiliser pour Galette. Conjointement à l'outil ``git-flow`` du même auteur, le processus est assez simple à suivre. Vous avez des doutes ? Jettez un oeil sur `cet article qui explique pourquoi vous devriez utiliser git-flow <https://jeffkreeftmeijer.com/2010/why-arent-you-using-git-flow/>`_.

source: This is perfectible (well, among many, many others :D), but this does the job, and ensures everyone works the same way.
fr: C'est perfectible (bon, parmi bien d'autres choses :D), mais ça fait la travail, et fait en sorte que tout le monde travaille dans le même sens.

source: Git configuration
fr: Configuration GIT

source: First, set your name and email in git configuration:
fr: Tout d'abord, définissez vos nom et courriel dans la configuration de GIT :

source: It is the minimal configuration required to use GIT :) Of course, there are a lot of other options available, see `this chapter about GIT configuration <https://git-scm.com/book/en/v2/Customizing-Git-Git-Configuration>`_.
fr: Il s'agit de la configuration minimale pour utiliser GIT :) Bien sûr, il y a beaucoup d'options disponibles, référez-vous `au chapitre sur la configuration de GIT <https://git-scm.com/book/en/v2/Customizing-Git-Git-Configuration>`_.

source: The commands above sets the configuration globally for all your Git repositories.
fr: La commande ci-dessus définit la configuration de manière générale sur tous vos dépôts GIT.

source: Removing the ``--global`` option will set the configuation locally in the repository your working on. It is usefull when you use different identities on several projects. But *in this case, don't forget to configure your repository after the initial clone*.
fr: Supprimez l'option ``--global`` définira la configuration dans le dépôt courant uniquement. C'est utile si vous souhaitez utiliser des identités différentes en fonction de vos projets. Mais dans ce cas, n'oubliez pas de configurer le dépôt après le clone initial.

source: Commit messages
fr: Messages de commit

source: Commit messages are not normalized, but we intend to follow `the official documentation note <https://git-scm.com/docs/git-commit/#_discussion>`_ about them:
fr: Les messages de commit ne sont pas normalisés, mais nous essayons de suivre `les notes de la documentation officielle <https://git-scm.com/docs/git-commit/#_discussion>`_ les concernant :

source: Though not required, it’s a good idea to begin the commit message with a single short (less than 50 character) line summarizing the change, followed by a blank line and then a more thorough description. The text up to the first blank line in a commit message is treated as the commit title, and that title is used throughout Git. For example, git-format-patch[1] turns a commit into email, and it uses the title on the Subject line and the rest of the commit in the body.
fr: Bien que ce n'est pas requis, ce peut être une bonne idée de commencer le message de commit avec un courte ligne (moins de 50 caractères) qui résume les changements, suivi d'une ligne vide, puis d'une description plus complète. Le texte de la première ligne est ainsi considéré comme le titre du commit, titre utilisé par la suite par GIT. Par exemple, la commande git-format-patch[1] transforme un commit en courriel et utilise le titre du commit pour le sujet du courriel, le reste se trouvera dans le corps.

source: The `Galette tracker <https://bugs.galette.eu/projects/galette>`_ can automatically link a commit to any issue, just use ``refs`` keyword in your commit message to reference a ticket, and ``fixes`` or ``closes`` to get it closed aswell. For example:
fr: Le `tracker de Galette <https://bugs.galette.eu/projects/galette>`_ peut automatiquement lier un commit à une demande, utilisez juste le mot-clé ``refs`` dans votre message de commit pour référence une demande, et ``fixes`` ou ``closes`` pour qu'elle soit fermée également. Par exemple :

source: This will close ticket 1, and add the commit as a reference in both tickets 2 and 3.
fr: Ceci fermera la demande 1, et référencera le commit dans les demandes 2 et 3.

source: Practical example : code modifications
fr: Exemple pratique : modification de code

source: If you want to use git-flow, please make sure it is properly installed
fr: Si vous utilisez git-flow, assurez-vous qu'il est bien installé.

source: Prepare the working copy
fr: Préparez la copie de travail

source: First of all, you'll have to clone Galette repository, and properly instanciate your working copy (installing all third party dependencies, etc). Please rely on :doc:`Galette source code <git>` page to find all details about it.
fr: Tout d'abord, vous devrez cloner le dépôt Galette, et instancier correctement votre copie de travail (installation des bibliothèques tierces, etc.). Merci de vous référer à la page :doc:`code source de Galette <git>` pour trouver tous les détails à ce sujet.

source: Then, initialize git-flow:
fr: Ensuite, initialisez git-flow :

source: When you clone the Galette GIT repository, you land on the ``master`` branch. This documentation assumes you are working on the ``develop`` branch.
fr: Lorsque vous clonez le dépôt Galette, vous arrivez sur la branche ``master``. Cette documentation part du principe que vous travaillez sur la branche ``develop``.

source: Then, since git-flow gives the details of what it does, just check the output ;)
fr: Ensuite, puisque git-flow vous donne le détail de ce qu'il a fait, vérifiez juste la sortie ;)

source: Add a feature
fr: Ajouter une fonctionnalité

source: To start working on a feature that we will name ``killer`` for the example :
fr: Pour commencer à travailler sur une nouvelle fonctionnalité que nous nommerons ``killer`` dans notre exemple :

source: And voila! Now you can work on your killer feature, congratulations!
fr: Et voilà ! Vous pouvez maintenant travailler sur votre fonctionnalité qui tue, félicitations !

source: While coding, it is a good pratice to bring back the last changes from the develop branch. First make sure ``develop`` is up to date, then run a rebase command from your ``feature/killer`` branch:
fr: Lorsque vous codez, il faut parfois récupére les derniers changements depuis la branche develop. Assurez-vous que ``develop`` soit à jour, et lancez ensuit un rebase sur votre branche ``feature/killer`` :

source: Once the development is over, send us the patch. The feature's finishings only happens on the main repository itself.
fr: Une fois le développement terminé, envoyez-nous le patch. La finalisation d'une fonctionnalité survient seulement sur le dépôt principal.

source: Fix a bug
fr: Corriger un bogue

source: To fix a bug, you'll use git-flow with the `hotfix` keyword instead of `feature`:
fr: Pour corriger un bogue, utilisez git-flow avec le mot clé `hotfix` au lieu de `feature` :

source: The main difference, as already explained, is that this branch will be based on the `master` branch.
fr: La principale différence, comme déjà expliqué, est que cette branche sera basée sur la branche `master`.

source: Practical example: send a new feature
fr: Exemple pratique : envoyer une nouvelle fonctionnalité

source: For technical reasons, we have created mirrors of all our GIT repositories on github. All the source code is on github, and you may prefer to use their fork/pull request capacities. It is ok as well.
fr: Pour des raisons techniques, nous avons créé des mirroirs de nos déôts GIT sur Github. Tout le code source est sur Gituhg, et si vous préférez utiliser leurs mécanismes de fork et de pull request, c'est OK également.

source: From your working branch (let's say you are sending the ``killer`` feature), generate a patch you can send to us:
fr: Depuis votre branche de travail (disons que vous envoyez votre fonctionnalité ``killer``), générez un patch que vous pourrez nous envoyer :

source: You can now attach those patches files to the `related ticket on Galette tracker <https://bugs.galette.eu/projects/galette/>`_ :) Please precise which branch you chose to start from.
fr: Vous pouvez maintenant ajouter ces patchs au `ticket relatif dans le tracker de Galette <https://bugs.galette.eu/projects/galette/>`_ :) Merci de préciser sur quelle branche votre travail est basé.

source: A few hints:
fr: Quelques astuces :

source: try to respect as possible :ref:`our coding standards <conventions>`,
fr: essayez de respecter autant que possible :ref:`nos conventions de codage <conventions>`,

source: test your work, and other features it may affect,
fr: testez votre travail, ainsi les autres fonctionnalités qu'il pourrait avoir affectées,

source: try to add unit tests.
fr: essayez d'ajouter des tests unitaires.
