Repository: Tezorc/galettedoc
Catalog: source/locale/*/LC_MESSAGES/development/debug.po
Languages: fr

source: Debug
fr: Déboguage

source: Galette writes in logs files (one file per day) stored in ``galette/data/logs`` if you do not change the log path configuration. But be aware that some errors will only be displayed in system PHP logs.
fr: Galette écrit dans des fichiers de log (un par jour) stockés dans ``galette/data/logs`` si vous n'avez pas modifié la configuration des chemins. Gardez en tête que certaines erreurs seront affichées uniquement des les logs système de PHP.

source: Verbosity level is fixed to ``INFO`` on a standard installation; you can :ref:`change log level <behavior>`.
fr: Le niveau de verbosité est défini sur ``INFO`` sur une installation standard ; vous pouvez ref:`modifier le niveau de verbosité des logs <behavior>`.

source: Writting in logs files takes ressources (writes to disk). The more logs are verbose, the more Galette will be "slow".
fr: L'écriture dans les logs consomme des ressources (écriture sur disque). Plus les logs sont verbeux, plus Galette sera « lent ».

source: Please also note it is possible some "sensitive" data are stored in the logs. `DEBUG` mode for example will store every query executed in the database!
fr: Merci de noter aussi que certaines données « sensibles » pourraient être enregistrées dans les logs. Le mode ``DEBUG`` par exemple enregistre toutes les requêtes envoyées à la base de données !

source: Several logs levels exists, you can find many use cases in the source code. They are defined by `the logs lib (Analog) <https://github.com/jbroadway/analog>`_, from the most critical to the less critical:
fr: Plusieurs niveaux de verbosité des logs existant, vous pourrez trouver de nombreux exemples dans le code source.Ils sont définis par `la bibliothèque de logs (Analog) <https://github.com/jbroadway/analog>`_, du plus critique au moins critique :

source: Galette modes
fr: Modes de Galette

source: Several modes are provided in Galette you can configure with ``GALETTE_MODE`` constant (:ref:`see Galette behavior configuration <behavior>`). This directive can take the following values:
fr: Plusieurs modes sont fournis dans Galette que vous pouvez configurer avec la constante ``GALETTE_MODE`` (:ref:`voir la configuration du comportement de Galette <behavior>`). Cette directive peut prendre les valeurs suivantes :

source: ``PROD``: production mode (non production instance should be on an other mode). This is the default mode for releases, but it may change in development branch.
fr: ``PROD`` : mode production (les instances qui ne sont pas en production devraient utiliser un autre mode). C'est le mode par défaut dans les releases, mais il peut changer dans la version de développement.

source: ``DEV``: development mode:
fr: ``DEV`` : mode développement :

source: unstable/not finished parts will be activated,
fr: les parties non terminées ou instables seront activées,

source: some data will not be stored in session,
fr: certaines données ne seront pas stockées en session,

source: default log level is set to ``DEBUG``,
fr: le niveau de verbosité des logs est défini à ``DEBUG``,

source: news won't be cached,
fr: les nouvelles ne seront pas cachées,

source: database verion check will not be done.
fr: la vérification de la version de la base de données ne sera pas effectuée.

source: ``DEMO``: demonstration mode, the same as ``PROD`` but with some features disabled like sending emails, modifying superadmin data, ...
fr: ``DEMO`` : mode démonstration, le même que ``PROD`` mais avec certaines fonctionnalités désactivées comme l'envoi de courriels, la modification des informations du super administrateur, ...

source: ``TEST``: reserved for unit tests.
fr: ``TEST`` : réservé aux tests unitaires.

source: ``MAINT``: maintainance mode. Only super admin will be able to login.
fr: ``MAINT`` : mode maintenance. Seul le super admin pourra se connecter.

source: Behavior configuration
fr: Configuration du comportement

source: It is possible to change some of Galette behaviors:
fr: Il est possible de modifier certains comportements de Galette :

source: `GALETTE_MODE`: :ref:`see Galette modes <galettemodes>` ;
fr: `GALETTE_MODE`: :ref:`voir les modes de Galette <galettemodes>` ;

source: `GALETTE_DISPLAY_ERRORS`: `true` to display error details in page. Really discouraged for production environments! You will not see errors if there is a routing redirect... And there are plenty of them.
fr: `GALETTE_DISPLAY_ERRORS` : `true` pour afficher les détails des erreurs sur la page. Fortement déconseillé pour les environnements de production ! Vous ne verrez pas les erreurs s'il y a une redirection des routes... Et il y en a pas mal.

source: `GALETTE_SYS_LOG`: `true` tells Galette to use system logs to log its own errors;
fr: `GALETTE_SYS_LOG` : `true` demande à Galette d'utiliser les logs système pour ses propres erreurs ;

source: `GALETTE_LOG_LVL`: log level;
fr: `GALETTE_LOG_LVL` : niveau de log ;

source: `NON_UTF_DBCONNECT` : disable explicitely UTf-8 connection to the database (for users who see encoding issues).
fr: `NON_UTF_DBCONNECT` : désactive la connection explicite en UTF8 à la base de données (pour les utilisateurs qui rencontrent des problèmes d'encodage).

source: `GALETTE_SYS_LOG` makes sense only with ``mod_php``. If you use FPM, you will have to set ``catch_worker_output`` to ``yes`` in your configuration; this will cause entries to be logged in FPM main log (not pool one)).
fr: `GALETTE_SYS_LOG` utile seulement avec ``mod_php``. Si vous utilisez FPM, vous devrez définir ``catch_worker_output`` à ``yes`` dans votre configuration ; ce qui enverra les entrées dans le log principal de FPM (pas celui du pool)).

source: You can add those directives in a ``config/behavior.inc.php``.
fr: Vous pouvez ajouter ces directives via ``config/behavior.inc.php``.

source: For example:
fr: Par exemple :
