Repository: Tezorc/galettedoc
Catalog: source/locale/*/LC_MESSAGES/development/i18n.po
Languages: fr

source: Internationnalisation (i18n)
fr: Internationalisation (i18n)

source: Galette source code is entirely internationnalised thanks to `GNU Gettext <https://www.gnu.org/software/gettext/>`_. All translatable strings in the source code must be in english.
fr: Le code source de Galette est intégralement localisé à l'aide de `GNU Gettext <https://www.gnu.org/software/gettext/>`_. Toutes les chaînes à traduire dans le code doivent être en anglais..

source: The ``lang`` directory contains:
fr: Le dossier ``lang`` contient :

source: ``Makefile``, ``make_lang_l12n.py``, ``xgettext.py``: utilities to manage translations,
fr: ``Makefile``, ``make_lang_l12n.py``, ``xgettext.py`` : utilitaires pour gérer les traductions,

source: ``*.pot``: transaltions template files, one per domain,
fr: ``*.pot`` : gabarit pour les traductions, un par domaine,

source: ``*.po``: translation files, one per lang and per domain.
fr: ``*.po`` : fichiers de traduction un par langue et par domaine.

source: `Galette core <https://hosted.weblate.org/projects/galette/galette/>`_ is translated using `Weblate <https://hosted.weblate.org/>`_ platform. `Galette documentation translations <https://translate.zanata.org/project/view/galettedoc>`_ are still using `Zanata <https://zanata.org/>`_ platform, but will certainly move to Weblate as well in the future..
fr: `Le cœur de Galette <https://hosted.weblate.org/projects/galette/galette/>`_ est traduit via la plateforme `Weblate <https://hosted.weblate.org/>`_. `La traduction de la documentation de Galette <https://translate.zanata.org/project/view/galettedoc>`_ utilise encore la plateforme `Zanata <https://zanata.org/>`_, mais migrera certainement vers Weblate aussi dans le futur.

source: Syntax
fr: Syntaxe

source: Two different types of syntax are used:
fr: Deux différents types de syntaxes sont utilisés :

source: PHP syntax,
fr: syntaxe PHP,

source: Smarty syntax.
fr: syntaxe Smarty.

source: For PHP syntax, this is the ``_T`` function that is used. There is a second optionnal argument for translation domain, which defaults to `galette`.
fr: Pour la syntaxe PHP, c'est la fonction ``_T`` qui est utilisée. Elle prend un second argument optionnel pour le domaine, dont le défaut est `galette`.

source: Another method, ``__()`` is very similar to ``_T()``. This one will not mark strings which miss a translation.
fr: Une autre méthode, ``__()`` est très similaire à ``_T()``. Cette dernière ne marquera pas les chaînes non traduites.

source: This was used to translate routes mainly; but this is no longer possible.
fr: C'était utilisé pour traduire les routes principalement, mais ce n'est désormais plus possible.

source: Often, you will have to use variables in translated strings. To do that, use a placeholder in the string to translate, and use something like ``str_replace`` or ``preg_replace`` to do the effective replacement:
fr: Souvent, vous aurez besoin d'utiliser des variables dans les chaînes à traduire. Pour cela, utilisez un élément de substitution et utilisez une fonction comme ``str_replace`` ou ``preg_replace`` pour effectuer le remplacement :

source: You can use any word you want as pattern, just try to keep simple for others :) There are several other ways to handle string replacements, check PHP documentation.
fr: Vous pouvez utiliser les mots que vous voulez en motif, essayez de rester simple pour les autres :) Il y a différents possibilités pour gérer des remplacements dans les chaînes, consultez la documentation de PHP.

source: Smarty translation is done with a custom plugin:
fr: Les traduction dans les gabarits Smarty sont gérées par un plugin personnalisé :

source: Smarty comes with `modifiers` that may be used to do remplacements among others. But it is done before the text is sent to the plugin, so translation cannot be found (it already contains a replacement value for our pattern). Our Smarty plugin can take two optionnal arguments to handle properly replacements:
fr: Smarty founit des `modifiers` qui peuvent être utilisés pour effectuer des remplacements au sein de chaînes entre autres. Mais le remplacement est effectué avant que le texte ne soit envoyé au plugin, et donc la traduction ne peut être trouvée (les substitutions y sont déjà effectuées). Notre plugin Smarty peut prendre deux arguments optionnels pour gérer correctement ces remplacements :

source: Translation domains
fr: Domaines de traduction

source: Galette uses translation domains to prevent string replacements from external sources. Default domain name (implicit if not specified) is ``galette``
fr: Galette utilise des domaines de traduction pour éviter que les chaines ne soient remplacées par des sources externes. Le domaine par défaut (implicite si non défini) est ``galette``.

source: Each plugin will come with at least one domain of its own.
fr: Chaque plugin fournit son propre domaine.

source: You must then tell the functions which domain you want to use:
fr: Vous devez dire aux fonctions quel domaine vous souhaitez utiliser :

source: Same example, with Smarty:
fr: Le même exemple, avec Smarty :

source: Generate lang files
fr: Génération des fichiers de langue

source: There are several steps to update Galette translations:
fr: Il y a plusieurs étapes pour mettre à jour les traductions de Galette :

source: extract strings from source code and update translation templats (POT files) (run ``make extract`` from lang directory and commit updated POT file),
fr: extraire les chaînes depuis le code source et mettre à jour les gabarits de traductions (fichiers pot) (lacez ``make extract`` depuis le dossier lang et commiter les fichier POT mis à jour),

source: (let translators do their job)
fr: (laisser les traducteurs faire leur travail)

source: retrieve translated files (PO) from translation platform
fr: récupérer les fichiers traduits (PO) depuis la poateforme de traduciton

source: compile translation files (MO)
fr: compiler les fichiers de traduction (MO)

source: It is possible to generate local PO files with ``make po``, but all mecanisms assume the translation platform is used.
fr: Il est possible de générer les fichier PO en local avec ``make po``, mais tous les mécanismes partent du principe que la plateforme de traduction est utilisée.

source: Once the updated POT file has been pushed to the Github mirror, an update is triggered on the Weblate platform. Weblate translations are commited in a forked Git repository, and must be merged back to Galette:
fr: Une fois le fichier POT à jour a été envoyé sur le miroir Github, une mise à jour est déclenchée sur la plateforme Weblate. Les traductions Weblate sont commitées dans un clone du dépôt Git, et doivent être mergées dans Galette :

source: Finally, you must compile translations (compiled files are the ones used):
fr: Finalement, vous devez compiler les traductions (les fichiers compilés sont ceux qui seront utilisés) :

source: In order to refresh known languages, you will have to logout/login from your Galette instance. You may have to restart PHP as well.
fr: Pour rafraichir les langues connues, vous devrez vous déconnecter et vous reconnecter sur votre instance Galette. Vous devrez peut-être redémarrer le serveur PHP également.
