Repository: Tezorc/galettedoc
Catalog: source/locale/*/LC_MESSAGES/development/index.po
Languages: fr

source: :doc:`developer guide <index>`
fr: :doc:`guide du développeur <index>`

source: Developer manual
fr: Guide du développeur

source: The Galette project is kindly hosted by `TuxFamily <https://www.tuxfamily.org>`_:
fr: Le projet Galette est gracieusement hébergé par `TuxFamily <https://www.tuxfamily.org>`_ :

source: `Galette website <https://galette.eu/dc/?navlang=en>`_,
fr: `Le site web de Galette <https://galette.eu/dc/?navlang=en>`_,

source: :doc:`a GIT repository to manage Galette source code <git>`,
fr: :doc:`un dépôt GIT pour gérer le code source de Galette <git>`,

source: mailing lists,
fr: listes de diffusion,

source: There are also a few external services:
fr: Quelques services externes sont également utilisés :

source: `a bug tracker <https://bugs.galette.eu/projects/galette/>`_, to declare issues or to ask for evolutions,
fr: `un gestionnaire de bogues (tracker) <https://bugs.galette.eu/projects/galette/>`_, pour déclarer les anomalies ou demander des évolutions,

source: `a wonderfull :p documentation <https://doc.galette.eu>`_, you are currently reading,
fr: `une superbe :p documentation <https://doc.galette.eu>`_, que vous lisez actuellement,

source: `a voting system <https://vote.galette.eu>`_, you can vote for features,
fr: `un système de vote <https://vote.galette.eu>`_, sur lequel vous pouvez voter pour des fonctionnalités,

source: `a Github organization <https://github.com/galette>`_, used to run unit tests or documentation on readthedocs, among others,
fr: `une organisation Github <https://github.com/galette>`_, utilisée pour lancer les tests unitaires ou la construction de la documentation sur, entre autres,

source: `a continous integration system <https://travis-ci.org/galette/galette>`_, that runs a bunch of tests each time a commit is done on the github mirror.
fr: `un système d'intégration continue <https://travis-ci.org/galette/galette>`_, qui lance une série de tests chaque fois qu'un commit est effectué sur le miroir github.

source: `a Telemetry application <https://telemetry.galette.eu>`_ which handles and displays Telemetry data received from volunteer Galette instances.
fr: `une application de Telemetry <https://telemetry.galette.eu>`_ qui gère et affiche les informations de télémétrie reçues depuis les instances de Galette volontaires.

source: This documentation aims to help you understand the development rules of Galette, how the code is managed, ...
fr: Cette documentation a pour objectif de vous aider à comprendre les règles de développement de galette, comment le code est géré, ...
