Repository: Tezorc/galettedoc
Catalog: source/locale/*/LC_MESSAGES/development/plugins.po
Languages: fr

source: Writting plugins
fr: Écriture de plugins

source: From plugins, you can benefit from the entire Galette API, extends or complete it with classes, you can create specific pages, menu entries, and action buttons on members.
fr: Depuis les plugins, vous pouvez bénéficier de l'API de Galette, l'étendre ou la compléter avec des classes, vous pouvez créer des pages spécifiques, des entrées de menu et des boutons d'action sur les adhérents.

source: Plugin system was inspired from `DotClear blogging solution <https://dotclear.org/>`_.
fr: Le système de plugins a été inspiré par `la solution de blogging DotClear <https://fr.dotclear.org/>`_.

source: A ``plugins`` directory in Galette will host plugins, one directory per plugin is expected:
fr: Un dossier ``plugins`` dans Galette héberge les plugins, un dossier par plugin est attendu :

source: Just as in Galette, you will find a ``lang`` directory used for translation files, a ``template/default`` directory for Smarty templates, a ``lib`` directory for classes, ...
fr: Tout comme dans Galette, vous trouverez un dossier ``lang`` utilisé pour les traductions, un dossier ``template/default`` pour les gabarits Smarty, un dossier ``lib`` pour les classes, ...

source: None of those directories are mandatory, plugin may have no need for them :)
fr: Aucun de ces dossiers n'est requis, un plugin peut ne pas en avoir l'utilité :)

source: A :doc:`migration guide for plugins from Galette 0.8 to 0.9 <plugins-0.8-0.9>` is available.
fr: Un :doc:`guide de migration des plugins de Galette 0.8 à 0.9 <plugins-0.8-0.9>` est disponible.

source: All Galette :doc:`development informations <index>` also apply to plugins. You may need to :doc:`debug a bit <debug>` or :ref:`change application behavior <behavior>`
fr: Toutes :doc:`informations de dévelopment <index>` de Galette s'appliquent aussi aux plugins. Vous aurez peut-être besoin de :doc:`d'un peu de déboguage <debug>` ou :ref:`de modifier le comportement de l'application <behavior>`

source: Official Galette plugins are licensed under GPL version 3.
fr: Les plugins officiels de Galette sont sous licence GPL version 3.

source: Licence must:
fr: La licence doit :

source: be included in the root directory (``LICENSE`` or ``COPYING`` file),
fr: être incluse dans le dossier racine (fichier ``LICENSE`` ou ``COPYING``),

source: be present in all source file headers - if the selected license wants it.
fr: être présente dans les en-têtes des fichiers sources - si la licence retenue l'exige.

source: Plugins Configuration
fr: Configuration des plugins

source: A ``_define.php`` file must be present for each plugin. It defines plugin name, its author, ...
fr: Un fichier ``_define.php``doit être présent pour chaque plugin. Il définit son nom, son auteur, ...

source: If the file is missing or incorrect, plugin will not be loaded at all.
fr: Si le fichier est manquant ou incorrect, le plugin ne sera pas chargé.

source: Plugins compatibility
fr: Compatibilité des plugins

source: Plugins compatibility is a quite simple system: Galette define a compatibility version that does not change on every Galette release, and plugins declare a Galette compatible version. Those versions are compared, and plugin is marked as compatible if it declare to support current Galette version.
fr: Le système de compatibilité des plugins est assez simple : Galette définit une version qui ne change pas à chaque release, et les plugins déclarent une version de Galette compatible. Ces versions sont comparées, et les plugins marqués comme compatibles s'ils déclarent supporter la version de Galette courante.

source: On Galette side, compatibility version is declared with `GALETTE_COMPAT_VERSION` constant in ``galette/includes/galette.inc.php``. On plugin side, compatibility version is declared in the ``_define.php`` plugin file.
fr: Du côté de Galette, la version de compatibilité est déclarée avec la constante ``GALETTE_COMPAT_VERSION`` dans ``galette/includes/galette.inc.php``. Du côté des plugins, la version de compatibilité est déclarée dans le fichier ``_define.php`` du plugin.

source: You will need some URLs for your plugin. Galette rely on Slim framework to expose routes. Each URL fit a route, with a name, possible arguments, HTTP method, ...
fr: Vous aurez besoin d'URL pour votre plugin. Galette utilise le framework Slim pour exposer ses routes. Chaque URL correspond à une route, avec un nom, de possibles arguments, une méthode HTTP, ...

source: In plugins, you must add a ``_routes.php`` file. In this file, you will declare all your plugin URLs. Galette provide URL similar to ``{galette}/plugins/myplugin`` on which your own routes wil be append.
fr: Dans les plugins, vous devez ajouter un fichier ``_routes.php``. Dans ce dernier, vous déclarerez les URL de votre plugin. Galette fournit des URL du type ``{galette}/plugins/myplugin`` à laquelle vos propres routes seront ajoutées.

source: A route is constitued of the following elements:
fr: Une routes est constituée des éléments suivants :

source: an URL,
fr: une URL,

source: maybe some URL parameters, some may be required,
fr: éventuellement des paramètres d'URL, dont certains peuvent être requis,

source: a name (unique),
fr: un nom (unique),

source: access restriction,
fr: des restrictions d'accès,

source: a HTTP method (`GET` and/or `POST`).
fr: uen méthode HTTP (`GET` ou `POST`).

source: A simple route example would look like:
fr: Un exemple de route ressemblerait à :

source: This will respond to the URL ``{galette}/plugins/myplugin/main``; and it will just display `Welcome to the main page`.
fr: Cela répondra à l'URL ``{galette}/plugins/myplugin/main`` ; et affichera simplement `Welcome to the main page`.

source: Routes names must be unique. To prevent any collision, all plugins routes names must be prefixed with plugin name.
fr: Les noms des routes doivent être uniques. Pour prévenir toute collision, tous les noms de routes doivent être préfixés par le nom du plugin.

source: Routes can have parameters, mandatory or not. Following example add the `arg1` required parameter, and the `arg2` optionnal one:
fr: Les routes peuvent avoir des paramètres, requis ou non. L'exemple suivant ajoute l'argument requis `arg1` et l'argument optionnel `arg2` :

source: It is also possible to restrict a parameter value using regular expressions. See `Slim routing documentation <https://www.slimframework.com/docs/objects/router.html>`_ to know more.
fr: Il est également possible de restreindre la valeur d'un paramètre en utilisant une expression régulière. Référez-vous à `la documentation de routage de Slim <https://www.slimframework.com/docs/objects/router.html>`_ pour en savoir plus.

source: Routes and templates
fr: Routes et gabarits

source: Of course, you will probably need something more than simple ``echo`` from a display point of view;
fr: Bien sûr, vous aurez probablement besoin d'autre chose qu'un simple ``echo`` d'un point de vue affichage ;

source: Globally, inside Galette, `GET` routes displays informations (lists, forms, ...) and `POST` routes do actions. That way, forms will have a `POST` action, that will do the job, and then will redirect on a `GET` page.
fr: Globalement, dans Galette, les routes `GET` affichent des informations (listes, formulaires, ...) et les routes `POST` exécutent des actions. De cette manière, les formulaires auront une action `POST` qui fera le travvail, et redirigera ensuite vers la page `GET`.

source: Displaying a page from a Smarty template would look like:
fr: Afficher une page depuis un gabarit Smarty ressemblerait à :

source: The use of the ``$module['root']`` ensures the file you are trying to load is the one of your plugin. Without that, if Galette or another plugin provides a `file.tpl` file, it may be loaded frinstead of the one from your plugin, and this won't work. Then, ``file.tpl`` is core file ``file.tpl``, and ``file:[abcde]file.tpl`` the ``file.tpl`` file from plugin which identifier is ``abcde``.
fr: L'utilisation de ``$module['root']`` vous assure que le fichier que vous chargez est bien celui de votre plugin. Sans cela, si Galette ou un autre plugin fournit un fichier `file.tpl`, il pourrait être chargé à la place de celui de votre plugin, et ça ne fonctionnera pas. Donc, ``file.tpl`` est le ``file.tpl`` du cœur, et ``file:[abcde]file.tpl`` le fichier ``file.tpl`` du plugin dont l’identifiant est ``abcde``.

source: Galette is in charge to attribute identifiers to plugins. Do no try to guess it, and use ``$module['root']`` which is unique per plugin. Rely on the ``use`` keyword to pass it to your anonymous functions:
fr: Galette se charge d'attribuer des identifiants uniques aux plugins. N'essayez pas de le deviner, et utilisez ``$module['root']`` qui est unique par plugin. Le mot clé ``use`` sera utilisé pour le passer à vos fonctions anonymes :

source: Redirections are simple to do:
fr: Les redirections sont simples à mettre en œuvre :

source: Access restrictions
fr: Restrictions d'accès

source: Galette provides a `middleware <https://www.slimframework.com/docs/concepts/middleware.html>` which restricts routes access.
fr: Galette fournit un `middleware <https://www.slimframework.com/docs/concepts/middleware.html>` qui restreint l'accès aux routes.

source: Following roles can be used:
fr: Les rôles suivants peuvent être utilisés :

source: ``staff`` (staff members)
fr: ``staff`` (membres du bureau)

source: ``groupmanager`` (groups managers)
fr: ``groupmanager`` (responsables de groupes)

source: ``member`` (logged in user)
fr: ``member`` (utilisateur authentifié)

source: ``groupmanager`` and ``member`` roles requires additional work. A route that is accessible for groups managers, but their access must certainly be restricted to the groups they owns.
fr: Les rôles ``groupmanager`` et ``member`` requièrent un peu plus de travail. Une route est accessible pour les responsables de groupe, mais leur accès doit certainement être restreint aux groupes qu'il gèrent.

source: To add a restriction access to a route, call the ``$authenticate`` middleware on your route:
fr: Pour activer les restrictions d'accès sur une route, appelez le middleware ``$authenticate`` à votre route :

source: Along with that, you have to define the access to that route in your ``_define.php`` file. In the example from the begginning of the doc, ``myplugin_main`` route has been restricted to staff members only.
fr: En plus de cela, vous devrez définir l'accès à cette route dans votre fichier ``_define.php``. Dans l'exemple du début de la doc, la route ``myplugin_main`` est restreinte aux membres du bureau.

source: Pages which does not need any specific restriction will just not call the middleware. It is the same for pages which may be displayed for boths logged in and not. In that case, you must have logic in your route and/or in your classes to manage access.
fr: Les pages qui ne nécessitent pas de restrictions particulières ne feront pas appel au middleware. Il en va de même pour les pages qui seraient accessibles à la fois aux utilisateurs authentifiés et non authentifiés. Dans ce cas, la logique de gestion des accès devra se trouver dans votre route et/ou dans vos classes.

source: Public pages
fr: Pages publiques

source: Some of pages may be accessible without authentication, this is a Galette preference. For such pages, you will have to check if public pages are active for current logged in user:
fr: Certaines pages peuvent être accessibles sans authentification, c'est une préférence de Galette. Pour de telles pages, vous devrez vérifier si les pages publiques sont actives pour l'utilisateur courant :

source: Usage
fr: Utilisation

source: You will need to use links to your different routes, either in Smarty templates or in routes themselves (redirection case for example).
fr: Vous aurez à utiliser des liens vers vos routes, que ce soit dans les gabarits Smarty ou dans les routes elles mêmes (dans le cas d'une redirection par exemple).

source: From PHP code, you will use ``pathFor`` method. If route is waiting for parameters, send them as an indexed array:
fr: Depuis le code PHP, vous utiliserez la méthode ``pathFor``. Si la route attend des paramètres, envoyez les sous forme de tableau associatif :

source: From a Smarty template, use the ``path_for`` function:
fr: Depuis un gabarit Smarty, utilisez la fonction ``path_for`` :

source: If a required parameter is missing, path will not be generated and this will produce an error.
fr: Si un paramètre requis est manquant, le chemin ne sera pas généré et une erreur se produira.

source: Web resources
fr: Ressources web

source: In Galette, all resources that must be read from the server (images, CSS and javascript files) must be in the ``webroot`` directory in your plugin. This one will be kind of mapped to be served from the web.
fr: Dans Galette, toutes les ressources qui doivent être accessibles depuis le serveur web (images, fichiers CSS et Javascript) doivent être dans le dossier ``webroot`` de votre plugin. Il y aura une sorte de mapping pour que ces ressources soient servies depuis le web.

source: Heritage
fr: Héritage

source: Before Galette 0.9, templates was providing a page part only, and PHP code was in charge to include it in the page. But now, `template files must declare their heritage <https://www.smarty.net/docs/en/advanced.features.template.inheritance.tpl>`_.
fr: Avant Galette 0.9, les gabarits fournissaient une partie de la page seulement, et le code était en charge de l'incorporer dans la page. Mais maintenant, `les gabarits doivent déclarer leur héritage <https://www.smarty.net/docs/en/advanced.features.template.inheritance.tpl>`_.

source: Three parent templates are provided:
fr: Trois gabarits parent sont disponibles :

source: ``page.tpl`` for most of the pages,
fr: ``page.tpl`` pour la plupart des pages,

source: ``public_page.tpl`` for public pages,
fr: ``public_page.tpl`` pour les pages publiques,

source: ``ajax.tpl`` for AJAX called pages.
fr: ``ajax.tpl`` pour les pages appelées via AJAX.

source: Parents templates provide a ``content`` block to display page contents. ``page.tpl`` and ``public_page.tpl`` also provide a ``javascript`` to include all ``<script>`` elements at the right place. None of those blocks is mandatory, but an empty page would not make sense ;)
fr: Les gabarits parents fournissent un bloc ``content`` pour afficher le contenu de la page. ``page.tpl`` et ``public_page.tpl`` fournissent également un bloc ``javascript`` pour inclure tous les éléments ``<script>`` à l'emplacement adéquat. Aucun de ces bloc n'est obligatoire, mais une page sans contenu n'aurait probablement pas beaucoup de sens ;)

source: Parent template can be conditionned if you use a variable:
fr: Le gabarit parent peut être conditionné si vous utilisez une variable :

source: Variables assignement
fr: Assignation de variables

source: It is possible to pass global variables to Smarty (with ``$tpl->assign('my_var', 'my_value');``). To achieve that, add a ``_smarties.php`` file to your plugin. It may currently provide only one array named ``_tpl_assignments``:
fr: Il est possible de passer des variables globales à Smarty (avec ``$tpl->assign('my_var', 'my_value');``). Pour cela, ajoutez un fichier ``_smarties.php`` à votre plugin plugin. Il ne peut actuellement fournir qu'un seul tableau nommé ``_tpl_assignments`` :

source: All declared variables will be accessible from Smarty templates like all other variables: ``{$my_var}``.
fr: Toutes les variables déclarées seront accessibles depuis les gabarits Smarty comme toutes les autres variables : ``{$my_var}``.

source: Automatic replacements may occurs in declared variable, using specific strings:
fr: Des remplacements automatiques peuvent survenir dans les variables déclarées, en utilisant des chaînes spécifiques :

source: ``__plugin_include_dir__`` will look for ``includes`` directory in your plugin (will be ``./plugins/dir_name/includes/dossier`` for our example)
fr: ``__plugin_include_dir__`` cherchera le dossier ``includes`` de votre plugin (ce sera ``./plugins/dir_name/includes/dossier`` pour notre exemple)

source: ``__plugin_templates_dir__`` will be replaced with plugin ``templates`` directory (will be ``./plugins/dir_name/templates/`` for our example)
fr: ``__plugin_templates_dir__`` sera remplacé par le dossier ``templates`` de votre plugin (ce sera ``./plugins/dir_name/templates/`` pour notre exemple)

source: ``__plugin_dir__`` will be replaced with path to your plugin (will ``./plugins/dir_name/`` for our exemple)
fr: ``__plugin_dir__`` sera remplacé par le chemin vers votre plugin (ce sera ``./plugins/dir_name/`` pour notre exemple)

source: That way, whatever the directory name used, you'll find the good one :)
fr: De cette manière, quel que soit le dossier utilisé, vous trouverez le bon :)

source: Menu entries
fr: Entrées de menu

source: Menu links (and links in template more globally) will refer to a route using its name. Use the ``path_for`` Smarty function as already said.
fr: Les liens de manu (et les liens dans les gabarits d'une manière générale) feront référence à une route en utilisant son nom. Utilisez la fonction Smarty ``path_for``, comme déjà expliqué.

source: Presence of a ``menu.tpl`` file in your template directory will add its content below other Galette menu entries. It must be the same design as Galette core menus:
fr: La présecne d'un fichier ``menu.tpl`` dans votre dossier templates ajoutera son contenu après le menu de Galette. Il doit refléter le design des menus du cœur de Galette :

source: Public pages menu is distinct in Galette, if you want to add public pages in your menu, put compatible contents in ``public_menu.tpl``:
fr: Le menu des pages publiques est distinct dans Galette, si vous souhaitez ajouter des pages publiques dans votre menu, placez le contenu adéquat dans ``public_menu.tpl`` :

source: This menu entry will display a link for logged in members (first part) in the "Public pages" Galette menu, while second part is used to display top page button on public pages.
fr: Cette entrée de menu affichera un lien pour les adhérents connectés (première partie) dans le menu "Pages publiques" de Galette, tandis que la seconde partie sera utilisée pour afficher un bouton en haut des pages publiques.

source: Add HTML headers
fr: Ajout d'en-têtes HTML

source: When present, the content of ``header.tpl`` file will add its content in HTML pages headers (the ``<head>`` tag), just after core ones.
fr: S'il est présent, le contenu du fichier ``header.tpl`` sera ajouté aux pages HMTL (dans la balise ``<head>``), juste après celles du cœur.

source: Headers added this way will be used in the entire application. For CSS stylesheet files, please make sure not to change existing Galette rules, this may cause display issues.
fr: Les en-têtes ajoutés de cette façon seront utilisées dans toute l'application. Pour les fichiers CSS, assurez-vous de en pas changer les règles existantes de Galette, cela pourrait causer des bogues.

source: Also note the :ref:`path to the CSS file must be obtained using a route <plugins_web_resource>`.
fr: Notez également que :ref:`les chemins vers les fichiers CSS doivent être obtenus en utilisant une route <plugins_web_resource>`.

source: Add actions on members
fr: Ajout d'actions sur les adhérents

source: It is possible for a plugin to add actions on members, adding one or more entries in members list "actions" column, or displaying one member informations.
fr: Il est possible pour un plugin d'ajouter des actions sur les adhérents, en ajoutant une ou plusieurs entrées dans la colonne « actions » de la liste des adhérents, ou lors de l'affichage de la fiche membre.

source: An ``adh_actions.tpl`` file in your plugin templates will add new actions in members list, with a simple list of links:
fr: Un fichier ``adh_actions.tpl`` dans vos templates ajoutera de nouvelles action dans la liste des adhérents, avec une simple liste de liens :

source: Another file named ``adh_fiche_action.tpl`` in your plugin templates will add actions displaying a member for edition, as a HTML list element (``li`` tag):
fr: Un autre fichier nommé ``adh_fiche_actions.tpl`` dans les templates de votre plugin ajoutera des actions lors de l'affichage d'un adhérent pour modification, sous forme d'éléments de liste (balise ``li``) :

source: Each added action must of course add a PHP code that will handle sent data.
fr: Chaque action ajoutée devra bein spur ajouter du code PHP qui gérera les données envoyées.

source: Add combined actions on members
fr: Ajout d'actions combinées sur les adhérents

source: Some actions are available to be run combined with a members selection from the list, like mailings, CSV exports, labels generations, ... It is also possible to add that kind of action from a plugin. Create a ``adh_batch_action.tpl`` file in your plugin templates, it will contain a HTML list element (``li`` tag) with a send button (``<input type="submit"/>``):
fr: Certaines actions sont prévues pour être lancées en combinaison avec la sélection des adhérents dans la liste, comme les mailings, l'export CSV, la génération des étiquettes, ... Il est également possible d'ajouter ce genre d'action depuis un plugin. Créez un fichier ``adh_batch_action.tpl`` dans les gabarits de votre plugin, il contiendra des éléments de liste (balise ``li``) avec un bouton de soumission (``<input type="submit"/>``) :

source: Constants declaration
fr: Déclaration de constantes

source: If your plugin must own his own tables in database, it is adivsed to declare an extra prefix so each table can be easily identified in the database. You can declare constants in a ``_config.inc.php`` file to achieve that:
fr: Si votre plugin doit créer ses propres tables dans la base de données, il est fortement conseillé d'ajouter un préfixe supplémentaire, de manière à ce que chaque table soit correctement identifiée dans la base de données. Vous déclarerez les constantes dans un fichier ``_config.inc.php`` pour cela :

source: Call to a table in the code will then look like:
fr: L'appel à une table dans le code ressemblera alors à :

source: Every plugin must provide translations for new string it proposes. :doc:`Galette global internationalisation system <i18n>` applies here. The main task (exepted files update while developing plugin) consists to set up translation files the first time.
fr: Chaque plugin doit fournir les traduction des nouvelles chaînes qu'il propose. :doc:`Le système d'internationalisation de Galette <i18n>` s'applique ici. La tâche principale (en dehors de la mise à jour des fichiers durant le développement du plugin) consiste à mettre en place les fichiers de traduction la première fois.

source: Use an official plugin up to date as references, and copy ``lang/Makefile`` and ``lang/xgettext.py`` files in your own ``lang`` directory:
fr: Utilisez un plugin officiel à jour comme référence, et copiez les fichiers ``lang/Makefile`` et ``lang/xgettext.py`` dans votre propre dossier ``lang`` :

source: You will have to adapt ``Makefile`` file to your plugin:
fr: Vous devrez adapter le fichier ``Makefile`` à votre plugin :

source: change ``DOMAINS`` value to reflect translation(s) domain(s) of your plugin;
fr: changer la valeur de ``DOMAINS`` pour refléter le(s) domaine(s) de traduction de votre plugin ;

source: change ``LANGUAGES`` value to reflect available langs of your plugin;
fr: changer la valeur de ``LANGUAGES`` pour refléter les langues disponibles de votre plugin ;

source: adapt ``PHP_SOURCES`` value.
fr: adapter al valeur de ``PHP_SOURCES``.
