Repository: Tezorc/galettedoc
Catalog: source/locale/*/LC_MESSAGES/development/plugins.po
Languages: fr

source: ``PHP_SOURCES`` variables will list all files that mays contains strings to translate. Regarding your needs and your plugins directory hierarchy; they may vary. For example, for a plugin with only a few PHP classes and some Smarty templates, you would use:
fr: La variable ``PHP_SOURCES`` doit lister tous les fichiers qui peuvent contenir des chaînes à traduire. En fonction de vos besoins et de la hiérarchie de votre plugin, cela peut varier. Par exemple, pour un plugin avec juste quelques classes PHP et quelques gabarits Smarty, vous utiliseriez :

source: If you follow Galette development standards, you should not have to change ``PHP_SOURCES``. Advanced editing of the ``Makefile`` is out of the gaols of the documentation.
fr: Si vous respectez les conventions de codage de Galette, vous ne devriez pas avoir à changer ``PHP_SOURCES``. La modification plus avancée du fichier ``Makefile`` est hors du cadre de la présente documentation.

source: First time you will launch `make`, you may see a lot of errors. You should ignore them, the script is not happy to work with empty `PO` files :) All required directories and files will be created, and you can now use your translation tool to work on them.
fr: Au premier lancement de `make`, vous verrez pas mal d'erreurs. Vous devriez pouvoir les ignorer, le script n'aime pas travailler avec des fichiers `PO` vides :) Tous les dossiers requis seront créés, et vous pourrez utiliser votre outil de traduction pour travailler dessus.

source: Update scripts
fr: Scripts de mise à jour

source: In a new version, your plugin may need to add/change/drop new tables/columns/else in your tables. To achieve that, you must create a ``scripts`` directory. It is handled the exact same ay as ``{galette}/install/scripts/``, and must follow the same rules:
fr: Dans une nouvelle version, votre plugin sera peut-être amené à ajouter/modifier/supprimer des tables/colonnes/autre dans vos tables. Pour cela, vous devrez créer un dossier ``scripts``. Il sera utilisé de la même manière que ``{galette}/install/scripts/``, et doit suivre les même règles :

source: installation and update scripts must be provided for both MariaDB (MySQL) and PostgreSQL,
fr: les scripts d'installation et de mise à jour doivent être fournis pour MariaDB (MySQL) et PosqtgreSQL,

source: installation script names must be ``mysql.sql`` and ``pgsql.sql`` in order to be found from Galette,
fr: les noms des scripts d'installation doivent être ``mysql.sql`` et ``pgsql.sql`` pour être trouvés depuis Galette,

source: update scripts must also follow a naming convention: ``upgrade-to-{version}-{dbtype}.sql`` or ``upgrade-to-{version}.php``, where `{version}` is the new plugin version and `{dbtype}` the database type (`mysql` or `pgsql`). PHP update scripts does not rely on database engine, if there are specificities, they'll be handled in code itself.
fr: les scripts de mise à jour doivent également suivre une convention de nommage : ``upgrade-to-{version}-{dbtype}.sql`` ou ``upgrade-to-{version}.php``, où `{version}` est la version du plugin et `{dbtype}` le type de base de données (`mysql` ou `pgsql`). Les scripts de mise à jour PHP ne sont pas liés à une moteur de base de données, s'il y a des spécificités, elle devront alors être ajoutées dans le code lui-même.

source: Respecting those rules ensures plugin will be supported from the Galette plugins management interface, and user will be able to install or update easily your plugin.
fr: Le respect de ces règles assure que le plugin sera supporté depuis l'interface de gestion des plugins de Galette, et que les utilisateurs seront en mesure d'installer et de mettre à jour votre plugin facilement.

source: PHP classes
fr: Classes PHP

source: Plugins may need their own classes. For Galette, class name and `namespace <https://php.net/manual/language.namespaces.php>`_ (`namespace`) are importants.
fr: Les Plugins peuvent avoir besoin de leurs propres classes. Pour Galette, les nom de classe et `espace de noms <https://php.net/manual/fr/language.namespaces.php>`_ (`namespace`) sont importants.

source: All classes must be in the ``lib/{namespace}`` directory of your plugin. Each class is a PHP file which name is the class name (including case). Namespace is built with plugin name as declared in ``_define.php``. In our example, plugin name is ``Galette My Plugin`` and therefore the namespace will be ``GaletteMyPlugin``.
fr: Toutes les classes doivent être dans le dossier ``lib/{namespace}`` de votre plugin. Chaque classe est un fichier PHP donc le est celui de la classe (casse comprise). Le namespace est construit avec le nom du plugin tel que déclaré dans ``_define.php``. Dans notre exemple, le nom du plugin est ``Galette My Plugin`` et donc le namespace sera ``GaletteMyPlugin``.

source: The `MyClass` class will will be written in ``lib/GaletteMyPlugin/MyClass.php``:
fr: La classe ``MyClass`` sera écrite dans ``lib/GaletteMyPlugin/MyClass.php`` :

source: And to call it:
fr: Et pour l'appeler :

source: When you use namespaces, all other libraries or PHP objects used them aswell. In your ``MyClass``, names of classes will be resolved that way:
fr: Lorsque vous utilisez des espaces de noms, toutes les autres bibliothèques et objets de PHP vont faire de même. Dans votre classe ``MyClass``, le nom des classes sera résolu comme suit :

source: Third party libraries
fr: Bibliothèques tierces

source: Third party dependencies must not be included in plugin sources, but in releases only.
fr: Les bibliothèques tierces ne doivent pas être fournies dans les sources du plugin, mais dans les release seulement.

source: Galette uses :ref:`composer <deps>` to handle third party libraries, plugins can do the same if needed.
fr: Galette utilise :ref:`composer <deps>` pour gérer ses bibliothèques tierces, les plugins peuvent faire de même au besoin.

source: File system hierarchy
fr: Système de fichiers

source: Finally, a plugin directory should look like:
fr: Finalement, un dossier de plugin ressemblerait à :

source: And for all remaining development questions... Well, rely on `PHP manual <https://php.net/manual/>`_, `Smarty manual <https://www.smarty.net/docs/en/>`_, a mail client to `write to mailing lists <https://galette.eu/dc/index.php/pages/Contact?navlang=en#mailing_lists>`_, and potentially an `IRC client <https://hexchat.github.io/>`_ to join `Galette IRC channel <https://galette.eu/dc/index.php/pages/Contact?navlang=en#irc>`_ ;-)
fr: Et pour toutes les questions que vous pourriez encore vous poser au sujet du développement... Hé bien, référez-vous au `manuel PHP <https://php.net/manual/>`_, `manuel Smarty <https://www.smarty.net/docs/en/>`_, un client courriel pour `écrire aux listes de diffusion <https://galette.eu/dc/index.php/pages/Contact?navlang=fr#mailing_lists>`_, et potentiellement d'un `client IRC <https://hexchat.github.io/>`_ pour rejoindre le `canal IRC Galette <https://galette.eu/dc/index.php/pages/Contact?navlang=fr#irc>`_ ;-)

source: Just like `Galette core source code <codage>`_, plugins must follow :ref:`PSR2 coding standards <conventions>`: https://www.php-fig.org/psr/psr-2/
fr: Tout comme `le code source de Galette <codage>`_, les plugins doivent suivre les :ref:`conventions de codage PSR2 <conventions>` : https://www.php-fig.org/psr/psr-2/

source: Since Galette provide support for both MariaDB and PostgreSQL, it would be logicial for plugins to do the same.
fr: Puisque Galette supporte à la fois MariaDB et PostgreSQL, il serait logique que les plugins fassent de même.

source: Registration form
fr: Formulaire d'enregistrement

source: It is possible to reconfigure the registration form. A basic version is provided in Galette, that uses PDF models, but it may not suit everyone needs. The :doc:`fullcard plugin <../plugins/fullcard>` for example, will override to provide its own version, without any change in the browsers URL (completely invisible for users).
fr: Il est possible de reconfigurer le formulaire d'adhésion. Une version basique est fournie par Galette, qui utilise les modèles PDF, mais cela peut ne pas convenir à tous. Le :doc:`plugin fullcard <../plugins/fullcard>` par exemple, va remplacer par sa propre version, sans changement dans l'URL du navigateur (entièrement invisible pour les utilisateurs).

source: This is enabled by creating a ``_preferences.php`` file in your plugin, with a content like:
fr: Ceci est activé en créant un fichier ``_preferences.php`` dans votre plugin, avec un contenu du genre :

source: Galette events
fr: Évènements Galette

source: Galette emit some events when members, contributions and transactions are added, updated or removed. This is provided using `PHP league Event library <https://event.thephpleague.com/2.0/>`_.
fr: Galette émet des évènements lorsque des adhérents, des contributions et des transactions sont ajoutés, modifiés ou supprimés. C'est fourni par la bibliothèque `PHP league Event library <https://event.thephpleague.com/2.0/>`_.

source: All possible events are:
fr: Les évènements possibles sont :

source: In order to catch any of those events, you will need a :ref:`PHP class <plugins_phpclasses>` named ``PluginEventProvider`` in your plugin namespace, which must provide a ``provideListeners`` method:
fr: Pour attraper un de ces évènements, vous aurez besoin d'une :ref:`classe PHP <plugins_phpclasses>` nommée ``PluginEventProvider`` dans l'espace de noms de votre plugin, qui doit fournir une méthode ``provideListeners`` :

source: First argument of your listener is the event name, and the second an anonymous function that will receive the event itself as first argumennt, and an instance of the related Galette object. You can of course add several listeners on possible events.
fr: Le premier argument de votre écouteur est le nom de l'évènement, le second une fonction anonyme qui recevra l'évènement lui-même en premier argument et une instance de l'objet Galette en relation. Vous pouvez bien sûr ajouter plusieurs écouteurs sur les évènements possibles.
