Repository: Tezorc/galettedoc
Catalog: source/locale/*/LC_MESSAGES/development/technical_infos.po
Languages: fr

source: Technical informations
fr: Informations techniques

source: Third party libs
fr: Bibliothèques tierces

source: *Required version:* `3.x`
fr: *Version requise :* `3.x`

source: All URLs in Galette are handled with `Slim micro framework <https://www.slimframework.com/>`_.
fr: Toutes les URL dans Galette sont gérées à l'aide `du micro framework Slim <https://www.slimframework.com/>`_.

source: Where we previousely use on `.php` file per page to display, all is now in a routing system named and parameted. This makes changes and enhancements easiest and flexible. `Slim documentation <https://www.slimframework.com/docs/v3>`_ is a good starting point to understand how it works.
fr: Là où nous utilisions précédemment un fichier `.php` par page à afficher, tout est désormais géré par un système de routes nommées et paramétrées. Cela rend les changements et améliorations plus simples et flexibles. `La documentation de Slim <https://www.slimframework.com/docs/v3>`_ est un point point de départ pouru comprendre son fonctionnement.

source: *Required version:* `2.8.2` (see https://github.com/zendframework/zend-db/issues/322)
fr: *Version requise :* `2.8.2` (voir https://github.com/zendframework/zend-db/issues/322)

source: `Zend Db library to manage databases <https://framework.zend.com/manual/2.2/en/modules/zend.db.adapter.html>`_ is used to manage all databases queries.
fr: `La bibliothèque Zend Db poru gérer les bases de données <https://framework.zend.com/manual/2.2/en/modules/zend.db.adapter.html>`_ est utilisée pour gérer toutes les requêtes vers la base de données.

source: Even if the lib is compatible with several database systems; Galette is only compatible with:
fr: Bien que la bibliothèque soit compatible avec plusieurs systèmes de bases de données, Galettes t compatible uniquement avec :

source: `MySQL <https://mysql.com/>`_ with InnoDB support,
fr: `MySQL <https://mysql.com/>`_ avec le support InnoDB,

source: *Required version:* `1.x`
fr: *Version requise :* `1.x`

source: `Analog <https://github.com/jbroadway/analog/>`_ is used to handle log files.
fr: `Analog <https://github.com/jbroadway/analog/>`_ est utilisé pour gérer les fichiers de log.

source: *Required version:* `3.1.31`
fr: *Version requise :* `3.1.31`

source: Page display is handled by `Smarty templating system <https://www.smarty.net/>`_. All pages are rendered with a HTML5 doctype.
fr: L'affichage des pages est géré par `le système de gabarit Smarty <https://www.smarty.net/>`_. Toutes les pages sont rendues avec un doctype HTML5.

source: *Required version:* `6.x`
fr: *Version requise :* `6.x`

source: `TCPDF <https://www.tcpdf.org/>`_ is a PDF generation lib Used to produce all PDF from Galette.
fr: `TCPDF <https://www.tcpdf.org/>`_ est une bibliothèque de génération de PDF utilisée pour tous les PDF de Galette.

source: *Required versions:* `1.10.2` (JQuery), `1.10.3` (UI), `1.1.14` (Markitup)
fr: *Versions requises :* `1.10.2` (JQuery), `1.10.3` (UI), `1.1.14` (Markitup)

source: To make user interface a bit dynamic and improve user experience, we choose to use a Javascript framework. We rely on `JQuery <https://jquery.com>`_, among others:
fr: Pour rendre l'interface utilisateur un peu plus dynamique et améliorer l'expérience utilisateu, nosu avons choisi d'utiliser un framework Javascript. Nous utilisons `JQuery <https://jquery.com>`_, entre autres :

source: `JQuery UI <https://ui.jquery.com/>`_ to handle tabs, date selection, modals, ...
fr: `JQuery UI <https://ui.jquery.com/>`_ pour gérer les onglets, la sélection de dates, les modales, ...

source: `markItUp <https://markitup.jaysalvat.com>`_ used as HTML editor in mailings,
fr: `markItUp <https://markitup.jaysalvat.com>`_ utilisé comme éditeur HTML pour les mailings,

source: `Selectize.js <https://selectize.github.io/selectize.js/>`_ for dropdowns to look better and searchable.
fr: `Selectize.js <https://selectize.github.io/selectize.js/>`_ pour chercher dans les listes déroulantes et les rendre davantage esthétiques.

source: Sending mails
fr: Envoi de courriels

source: *Required version:* `*`
fr: *Version requise :* `*`

source: Sending mails ins Galette is done with `phpMailer library <https://github.com/PHPMailer/PHPMailer>`_.
fr: L'envoi de courriels dans Galette est assuré par `la bibliothèque phpMailer <https://github.com/PHPMailer/PHPMailer>`_.

source: Unit tests
fr: Tests unitaires

source: Galette uses `atoum testing framework <http://atoum.org>`_
fr: Galette utilise `le framework de tests atoum <http://atoum.org>`_
