Repository: Tezorc/galettedoc
Catalog: source/locale/*/LC_MESSAGES/about.po
Languages: fr_fr

source: About Galette's documentation
fr_fr: À propos de la documentation de Galette

source: `Galette <https://galette.eu/dc/>`_'s documentation, released under the terms of the `Attribution-ShareAlike 3.0 Unported <https://creativecommons.org/licenses/by-sa/3.0/>`_ license, is written using `reStructuredText <http://docutils.sourceforge.net/docs/ref/rst/restructuredtext.html>`_ and is built with `Sphinx documentation builder <https://www.sphinx-doc.org>`_.
fr_fr: La documentation de `Galette <https://galette.eu/dc/>`_, publiée sous les termes de la licence `Attribution-ShareAlike 3.0 Unported <https://creativecommons.org/licenses/by-sa/3.0/>`_, est écrite en `reStructuredText <http://docutils.sourceforge.net/docs/ref/rst/restructuredtext.html>`_ et est construite à l'aide du `système de documentation Sphinx <https://www.sphinx-doc.org>`_.

source: Sphinx allows to build documentation in various formats from the same sources. Galette's documentation is therefore available as HTML, PDF and EPUB formats; thanks to `Read the docs <https://readthedocs.io>`_.
fr_fr: Sphinx permet de construire la documentation dans des formats différents depuis une seule et même source. La documentation de Galette est donc disponible aux formats HTML, PDF et EPUB ; grâc à `Read the docs <https://readthedocs.io>`_.

source: Build documentation
fr_fr: Construire la documentation

source: First, clone repository, please refer to the :doc:`Galette Documentation GIT documentation to get its source <development/git>`.
fr_fr: Tout d'abord, clonez le dépôt, référez-vous à :doc:`la documentation GIT de Galette pour récupérer les sources <development/git>`.

source: `Sphinx <https://www.sphinx-doc.org/en/master/usage/installation.html>`_ to generate HTML and EPUB formats,
fr_fr: `Sphinx <https://www.sphinx-doc.org/en/master/usage/installation.html>`_ pour générer les formats HtML et EPUB,

source: a complete TeX/LaTeX environment to generate PDF (`TeX Live <https://www.tug.org/texlive/>`_, `MacTEx <https://www.tug.org/mactex/>`_, `MikTeX <https://miktex.org/>`_).
fr_fr: un environnement TeX/LaTeX complelt pour générer le PDF (`TeX Live <https://www.tug.org/texlive/>`_, `MacTEx <https://www.tug.org/mactex/>`_, `MikTeX <https://miktex.org/>`_).

source: To build the documentation, go to the root of the project (``galettedoc`` directory if you've cloned the GIT repository) and then run ``make`` with one of the formats you want to compile (``html``, ``epub``, ``latexpdf``). In order to build the documentation for all three formats, we would run:
fr_fr: Pour construire la documentation, placez vous à la racine du projet (un dossier ``galettedoc`` si vous avez cloné le dépôt GIT) puis lancez ``make``avec le ou les formats souhaités (``html``, ``epub``, ``latex``). pour construire la documentation dans ces trois formats, nous lancerions :

source: Translations
fr_fr: Traductions

source: In order to update translations, it is necessary to update POT files from the sources rst files. This can be achieved running the following command:
fr_fr: Pour mettre à jour les traductions, il est nécessaire de mettre à jour les fichiers POT depuis les fichiers source rst. Pour cela, vous lancerez la commande suivante :

source: In order to test your modifications locally on your workstation, you will need to build the documentation using an additional parameter with the ``make`` command. For example, to build the documentation in HTML in French, run :
fr_fr: Pour tester vos modifications sur votre poste de travail, vous devrez compiler la documentation en utilisant des paramètres complémentaires à la commande ``make``. Par exemple, pour construire la documentation en HTML en français, lancez :

source: By default, the ``make`` command will build the documentation in English.
fr_fr: Par défaut, la commande ``make`` compilera la documentation en anglais.

source: How to contribute?
fr_fr: Comment contribuer ?

source: `A bug tracker dedicated to the documentation <https://bugs.galette.eu/projects/documentation-galette>`_ allows you to inform us about all the issues you may find and submit us fixes or evolutions you would like to integrate in the project.
fr_fr: `Un gestionnaire de bogues dédié à la documentation <https://bugs.galette.eu/projects/documentation-galette>`_ vous permet de nous informer des problèmes que vous pourriez trouver et nous soumettre des correctifs ou des évolutions que vous souhaiteriez voir intégrées au projet.

source: All contributions to the documentation must follow the :doc:`same rules as contributions to the source code of Galette <development/contributor>`.
fr_fr: Toutes les contributions à la documentation doivent suivre :doc:`les règles de contribution au code source de Galette <development/contributor>`.
